<?php
/**
 * Created by PhpStorm.
 * User: Administrator
 * Date: 2018-09-15
 * Time: 17:16
 */

return [
	'error_code' => [
		'0' => 'ok',
		'1000' => '未知错误',
		'1001' => '非法请求',
		'1002' => '接口不存在',
		'1003' => '接口地址错误',
		'1444' => '测试信息',
		'10001' => '缺少参数',
		'10002' => '参数错误',
		'10003' => '查询失败',
		'10004' => '数据不能为空',
		'10005' => '数据写入失败',
		'10006' => '数据添加失败',
		'10007' => '数据已存在',
		'10008' => '未找到要删除的数据',
		'10009' => '操作数据异常',
		'10010' => '数据未找到',
		'10011' => '校验未通过',
		'10012' => '请上传文件',
		'10013' => '文件上传失败',
		'10014' => '未找到事件订阅者',

		'11001' => '请先登录',
		'11002' => '没有权限',
		'11003' => '用户名或密码错误',
		'11004' => '权限获取失败',
		'11005' => 'uid获取失败',
		'11006' => '密码修改失败',
		'11007' => '用户信息获取失败',
		'11008' => '用户信息获取异常，请重试',
		'11009' => '用户token无效',
		'11010' => '账号已被删除或禁用',
		'11011' => '找不到用户',
		'11012' => '分享用户id为空',
		'11013' => 'uid无效',
		'11014' => '今日已签到',
		'11015' => '要增加币数量为0',
		'11016' => '验证码错误',
		'11017' => '手机号已注册，请直接登录',
		
		'11024' => '原密码校验失败',
		'11025' => '币不足',
		
		'12001' => '没有匹配的常规费用规则',
		'12002' => '没有匹配的补分计费规则',
		'12003' => '没有匹配的计费规则',
		
		'13001' => '找不到订单',
		'13002' => '订单状态不正确',
		'13003' => '找不到退款单',
		'13004' => '退款单状态不正确',
		'13005' => '找不到支付单',
		'13006' => '支付单状态不正确',
		'13007' => '金额超限',
		
		// 第三方登录
		'14001' => '未找到三方记录',
		'14002' => 'uid无效',
		'14003' => 'uid找不到用户',
		'14004' => '已绑定过用户',
		'14005' => '数据为空',
		'14006' => '请先绑定用户',
		'14007' => '绑定失败',
		'14008' => '会话token已过期 请重新登录',
		'14009' => '会话token信息异常 请重新登录',
		
	],
];